pablotg43/Riego-ESP8266/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <FS.h>
#include <LittleFS.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <PubSubClient.h>
#include <Wire.h>

AsyncWebServer server(80);

const char *ssid = "ESP32-Access-Point";
const char *password = "123456789";

const char *ssidhs = "ESP32-Access-Point";
const char *passwordhs = "123456789";

// Entradas Digitales
const int Entrada_configuracion = 12;
int Valor_entrada_configuracion = 0;

// Salidas Digitales
const int Salida[4] = {5, 4, 0, 2};

enum Estados {
  Reposo,
  Riego_1,
  Riego_2,
  Riego_3,
  Riego_4,
  Esperando_inicio,
  Esperando_ciclo,
  Ciclo_riego_1,
  Ciclo_riego_2,
  Ciclo_riego_3,
  Ciclo_riego_4,
  Configuracion
};

Estados estado = Estados::Reposo;

// Inicialización Variables
// unsigned long horas = 3600000;
// unsigned long minutos = 60000;

unsigned long horas = 60000;
unsigned long minutos = 1000;

//Temporizadores
unsigned long now = 0;
unsigned long temp_comms = 0;
unsigned long temp_inicio = 0;
unsigned long temp_ciclo = 0;
unsigned long temp_estado = 0;

//Tiempos
unsigned long Tiempo_inicio = 0;          // minutos hasta primer inicio
unsigned long Duracion[4] = {0, 0, 0, 0}; // minutos activo
unsigned long Ciclo = 0;                  // horas entre inicios

//Ordenes
boolean start[4] = {false, false, false, false};
boolean stop = false;
boolean primera_vez=false;
//Varios
String s1c[4] = {"s1", "s2", "s3", "s4"};
String s1ctext[4] = {"off", "off", "off", "off"};

// Nombres equipos y señales
int numero_puerto_MQTT = 1883;
const char *nmqtt = "ptg43.mooo.com";
const char *nombre_dispositivo = "wemo_riego_1";
String nombre_estado = "Salida_1";
String nombre_completo_salida[4] = {"Salida_1", "Salida_2", "Salida_3", "Salida_4"};
String nombre_completo_salida_general = "Entrada_Configuracion";
String nombre_completo_entrada_configuracion = "Entrada_Configuracion";
String nombre_completo_tiempo_inicio = "Salida_1";
String nombre_completo_duracion[4] = {"Salida_1", "Salida_2", "Salida_3", "Salida_4"};
String nombre_completo_ciclo = "Salida_1";
String nombre_completo_stop ="Stop";
boolean conf = false;

// Valores funcionamiento normal wifi y mqtt
WiFiClient espClient;
PubSubClient client(espClient);
char msg[50];
int value = 0;

#include <servidor.txt>

void proximoEstado() 
{
  
  switch (estado) {
    case Estados::Reposo:
        if      (start[0]) {estado=Estados::Riego_1; primera_vez=true;}
        else if (start[1]) {estado=Estados::Riego_2; primera_vez=true;}
        else if (start[2]) {estado=Estados::Riego_3; primera_vez=true;}
        else if (start[3]) {estado=Estados::Riego_4; primera_vez=true;}
        else if (Ciclo>0) {estado=Estados::Esperando_inicio; primera_vez=true;}
    break;
    case Estados::Riego_1:
        if (Tiempo_inicio>0) {estado=Estados::Esperando_inicio; primera_vez=true;}
        else if (Ciclo>0) {estado=Estados::Esperando_ciclo; primera_vez=true;}
        else {estado=Estados::Reposo; primera_vez=true;}
    break;
    case Estados::Riego_2:
        if (Tiempo_inicio>0) {estado=Estados::Esperando_inicio; primera_vez=true;}
        else if (Ciclo>0) {estado=Estados::Esperando_ciclo; primera_vez=true;}
        else {estado=Estados::Reposo; primera_vez=true;}
    break;
    case Estados::Riego_3:
        if (Tiempo_inicio>0) {estado=Estados::Esperando_inicio; primera_vez=true;}
        else if (Ciclo>0) {estado=Estados::Esperando_ciclo; primera_vez=true;}
        else {estado=Estados::Reposo; primera_vez=true;}
    break;
    case Estados::Riego_4:
        if (Tiempo_inicio>0) {estado=Estados::Esperando_inicio; primera_vez=true;}
        else if (Ciclo>0) {estado=Estados::Esperando_ciclo; primera_vez=true;}
        else {estado=Estados::Reposo; primera_vez=true;}
    break;
    case Estados::Esperando_inicio:
        if (Ciclo>0) {estado=Estados::Ciclo_riego_1; primera_vez=true;}
        else {estado=Estados::Reposo; primera_vez=true;}
    break;
    case Estados::Ciclo_riego_1:
        if (Ciclo>0) {
            if (stop) {estado=Estados::Esperando_ciclo; primera_vez=true;}
            else      {estado=Estados::Ciclo_riego_2; primera_vez=true;}
        }
        else {estado=Estados::Reposo; primera_vez=true;}
    break;  
    case Estados::Ciclo_riego_2:
        if (Ciclo>0) {
            if (stop) {estado=Estados::Esperando_ciclo; primera_vez=true;}
            else      {estado=Estados::Ciclo_riego_3; primera_vez=true;}
        }
        else {estado=Estados::Reposo; primera_vez=true;}
    break;  
    case Estados::Ciclo_riego_3:
        if (Ciclo>0) {
            if (stop) {estado=Estados::Esperando_ciclo; primera_vez=true;}
            else      {estado=Estados::Ciclo_riego_4; primera_vez=true;}
        }
        else {estado=Estados::Reposo; primera_vez=true;}
    break;  
    case Estados::Ciclo_riego_4:
        if (Ciclo>0) {
            if (stop) {estado=Estados::Esperando_ciclo; primera_vez=true;}
            else      {estado=Estados::Esperando_ciclo; primera_vez=true;}
        }
        else {estado=Estados::Reposo; primera_vez=true;}
    break;  
    case Estados::Esperando_ciclo:
        if (Ciclo>0) {estado=Estados::Ciclo_riego_1; primera_vez=true;}
        else {estado=Estados::Reposo; primera_vez=true;}
    break;
    case Estados::Configuracion:

    break;            
    }
}

void notFound(AsyncWebServerRequest *request)
{
    request->send(404, "text/plain", "Not found");
}

String readFile(fs::FS &fs, const char *path)
{
    Serial.printf("Reading file: %s\r\n", path);
    File file = LittleFS.open(path, "r");
    if (!file || file.isDirectory())
    {
        Serial.println("- empty file or failed to open file");
        return String();
    }
    Serial.println("- read from file:");
    String fileContent;
    while (file.available())
    {
        fileContent += String((char)file.read());
    }
    file.close();
    Serial.println(fileContent);
    return fileContent;
}

void writeFile(fs::FS &fs, const char *path, const char *message)
{
    Serial.printf("Writing file: %s\r\n", path);
    File file = LittleFS.open(path, "w");
    if (!file)
    {
        Serial.println("- failed to open file for writing");
        return;
    }
    if (file.print(message))
    {
        Serial.println("- file written");
    }
    else
    {
        Serial.println("- write failed");
    }
    file.close();
}

String processor(const String &var)
{
    Serial.print("var: ");
    Serial.println(var);

