pablotg43/Riego-ESP8266/src/main.cpp
            case Estados::Esperando_inicio:
                if (primera_vez)
                {                
                    temp_estado=now;
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "off";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Tiempo_inicio) { 
                    proximoEstado(); 
                }                
                break;

            case Estados::Esperando_ciclo:
                if (primera_vez)
                {                
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "off";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_ciclo > Ciclo) { 
                    proximoEstado(); 
                }                   
                break;

            case Estados::Ciclo_riego_1:
                if (primera_vez)
                {                
                    temp_estado=now;
                    temp_ciclo=now;
                    //Estado
                    digitalWrite(Salida[0], HIGH);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: on");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "on";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[0]) { 
                    proximoEstado(); 
                }                
                break;

            case Estados::Ciclo_riego_2:
                if (primera_vez)
                {                
                    temp_estado=now;
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], HIGH);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: on");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "on";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[1]) { 
                    proximoEstado(); 
                }                 
                break;

            case Estados::Ciclo_riego_3:
                if (primera_vez)
                {                
                    temp_estado=now;
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], HIGH);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: on");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "on";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[2]) { 
                    proximoEstado(); 
                }                 
                break;
    
            case Estados::Ciclo_riego_4:
                if (primera_vez)
                {                
                    temp_estado=now;
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], HIGH);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: on");
                    s1ctext[0] = "off";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "on";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[3]) { 
                    proximoEstado(); 
                }             
                break;
                
                case Estados::Configuracion:
                
                break;

        }
    }
}
